# ANS  = 1

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('test.csv') # This is csv the file reading function.

In [3]:
df.head() # this  the that allow to see top 5 row of data. we check the datatset.

   seq_id                                   protein_sequence  pH data_source
0   31390  VPVNPEPDATSVENVAEKTGSGDSQSDPIKADLEVKGQSALPFDVD...   8   Novozymes
1   31391  VPVNPEPDATSVENVAKKTGSGDSQSDPIKADLEVKGQSALPFDVD...   8   Novozymes
2   31392  VPVNPEPDATSVENVAKTGSGDSQSDPIKADLEVKGQSALPFDVDC...   8   Novozymes
3   31393  VPVNPEPDATSVENVALCTGSGDSQSDPIKADLEVKGQSALPFDVD...   8   Novozymes
4   31394  VPVNPEPDATSVENVALFTGSGDSQSDPIKADLEVKGQSALPFDVD...   8   Novozymes

In [4]:
df.describe() # This function give us whole idiea about data.

             seq_id      pH
count   2413.000000  2413.0
mean   32596.000000     8.0
std      696.717422     0.0
min    31390.000000     8.0
25%    31993.000000     8.0
50%    32596.000000     8.0
75%    33199.000000     8.0
max    33802.000000     8.0

In [5]:
df.memory_usage()  # This function tells us that how much memmory is used .

Index                 128
seq_id              19304
protein_sequence    19304
pH                  19304
data_source         19304
dtype: int64

In [6]:
df['pH'].value_counts() # counnt the unique values from data.

8    2413
Name: pH, dtype: int64

# ANS = 2

In [7]:
data_fram = {'A': [1,2,3,4,5],
             'B': [6,7,8,9,10],
             'C': [11,12,13,14,15],
        
            } 

df = pd.DataFrame(data_fram)

In [8]:
df

   A   B   C
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15

In [9]:
df.reindex()[1::2]

   A  B   C
1  2  7  12
3  4  9  14

# ANS = 3

In [10]:
data_fram = {'values': [10, 20, 30, 40, 50]}

df = pd.DataFrame(data_fram)

In [11]:
df['values'][:3].sum()

60

# ANS = 4

In [12]:
df1 = {'text': ['Hello sir how are you', 'i hop you are well','and you doing well also i your job ']}
df = pd.DataFrame(df1)

In [13]:
df

                                  text
0                Hello sir how are you
1                   i hop you are well
2  and you doing well also i your job

In [14]:
df['Word_count'] =  df['text'].str.count(' ')+1

In [15]:
df

                                  text  Word_count
0                Hello sir how are you           5
1                   i hop you are well           5
2  and you doing well also i your job            9

# ANS = 5

In [16]:
"""
This are some basic diffrences that differ DataFram.size and DataFram.shape.

The size property returns the number of elements in the DataFrame. 
The number of elements is the number of rows * the number of columns.

shape attribute in Pandas enables us to obtain the shape of a DataFrame. 
For example, if a DataFrame has a shape of (80, 10) , 
this implies that the DataFrame is made up of 80 rows and 10 columns of data.

"""

'\nThis are some basic diffrences that differ DataFram.size and DataFram.shape.\n\nThe size property returns the number of elements in the DataFrame. \nThe number of elements is the number of rows * the number of columns.\n\nshape attribute in Pandas enables us to obtain the shape of a DataFrame. \nFor example, if a DataFrame has a shape of (80, 10) , \nthis implies that the DataFrame is made up of 80 rows and 10 columns of data.\n\n'

# ANS = 6

In [17]:
# Read_excal function we have used for read a excal file.

# ANS = 7

In [18]:
Data_Frame = {"Email": [str(input("enter a eamil addrece:-"))]}

df = pd.DataFrame(Data_Frame)

enter a eamil addrece:- jangirkundan540@gmail.com

In [19]:
df

                       Email
0  jangirkundan540@gmail.com

In [20]:
df['Username']= df['Email'].str.split('@').str[0]

In [21]:
df

                       Email         Username
0  jangirkundan540@gmail.com  jangirkundan540

# Ans  = 8

In [22]:
data = {"A": [3,8,6,2,9],
       "B":[5,2,9,3,1],
        "C":[1,7,4,5,2]
       }

df = pd.DataFrame(data)

In [23]:
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [24]:
def select_data(df):
    selected_data = df[(df["A"]>5)&(df["B"]<10)]
    return selected_data

In [25]:
selected_data = select_data(df)
selected_data[["A","B","C"]][:5:2]

   A  B  C
1  8  2  7
4  9  1  2

# ANS = 9

In [26]:
df = pd.DataFrame({'Values':[2,4,6,8]})

In [27]:
df

   Values
0       2
1       4
2       6
3       8

In [28]:
df.mean()

Values    5.0
dtype: float64

In [29]:
df.median()

Values    5.0
dtype: float64

In [30]:
df.std()

Values    2.581989
dtype: float64

# ANS = 10

In [38]:
data = {'Sales': [200,500,100,800,700,600,900],
        'Date': [5-4-2023,6-4-2023,7-4-2023,8-4-2023,9-4-2023,10-4-2023,11-4-2023]
       }

df = pd.DataFrame(data)

In [39]:
def add_moving_average(df):
    # Sort the DataFrame by the Date column
    df = df.sort_values('Date')

    # Use rolling() and mean() to calculate the moving average
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()

    return df

In [40]:
print(add_moving_average(df))

   Sales  Date  MovingAverage
0    200 -2022     200.000000
1    500 -2021     350.000000
2    100 -2020     266.666667
3    800 -2019     400.000000
4    700 -2018     460.000000
5    600 -2017     483.333333
6    900 -2016     542.857143

# ANS = 11

In [52]:
data = {'date': ['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05'] }

df = pd.DataFrame(data)

In [53]:
df

         date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [56]:
df['date'] = pd.to_datetime(df['date'])

In [60]:
df['Weekday'] = df['date'].dt.day_name()

In [61]:
df

        date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

# ANS = 12

In [67]:
dates = ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']

df = pd.DataFrame({'Date': pd.to_datetime(dates)})
start_date = '2023-01-01'
end_date = '2023-01-31'
mask = (df['Date'] >= start_date) & (df['Date'] <= end_date)
selected_rows = df.loc[mask]

In [69]:
selected_rows

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [70]:
# ANS = 13

In [71]:
"""
he first and foremost library that needs to be imported to use the basic functions
of pandas is the pandas library itself.

"""

'\nhe first and foremost library that needs to be imported to use the basic functions\nof pandas is the pandas library itself.\n\n'